# AsValueString Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyType..::..AsValueString Method
FamilyType Class See Also
---
Provides access to value as a string with unit in the given family parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string AsValueString(
	FamilyParameter familyParameter
)
```

Visual Basic
---
```text
Public Function AsValueString ( _
	familyParameter As FamilyParameter _
) As String
```

Visual C++
---
```text
public:
String^ AsValueString(
	FamilyParameter^ familyParameter
)
```

# ### Parameters
familyParameter
    Type: Autodesk.Revit.DB..::..FamilyParameter
# ### Return Value
The string that represents the parameter value with unit.
# Remarks
The method only applies to parameters of value types. If the parameter has no value or does not contain a numeric value, the method returns nullNothingnullptra null reference (Nothing in Visual Basic).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the input argument-"familyParameter"-is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown if the input argument-"familyParameter"-is invalid. |

# See Also
FamilyType Class
Autodesk.Revit.DB Namespace